AntonG97/st7789vw-gd32-driver/src/sku22632.c
/* 
Replace this file with your code. Put your source files in this directory and any libraries in the lib folder. 
If your main program should be assembly-language replace this file with main.S instead.

Libraries (other than vendor SDK and gcc libraries) must have .h-files in /lib/[library name]/include/ and .c-files in /lib/[library name]/src/ to be included automatically.
*/

#include "gd32vf103.h"
#include "../include/sku22632.h"
#include "../include/lcd_font.h"

typedef enum{
	SWRESET = 0x01,	//SW reset
	SLPIN = 0x10,	//LCD power saving mode
	SLPOUT = 0x11, 	//LCD turn off power saving mode
	NORON = 0x13,	//Normal display mode on
	INVOFF = 0x20, 	//Display inversion off
	INVON = 0x21,	//Display inversion on
	GAMSET = 0x26,	//Gamma set
	DISPOFF = 0x28,	//Display OFF
	DISPON = 0x29, 	//Display ON
	CASET = 0x2A,	//Column adress set + 4 bytes of data
	RASET = 0x2B,	//Row adress set + 4 bytes of data
	RAMWR = 0x2C, 	//Memory write. Transfer data from MCU to frame mem. When cmd accepted, col and page set to start pos
	MADCTL = 0x36,	//Memory data access control
	COLMOD = 0x3A,	//Interface pixel format
	WRDISBV = 0x51,	//Write display brightness + 1 byte (0x00 => Lowest 0xFF => Highest)
}cmd;

typedef struct{
	uint32_t amount_trans;		//Amount of transfers
	uint8_t type;				//LOW (0) => HIGH (1) => Data			
	uint16_t payload;					
}dma_spi_data_t;

//DMA
static void lcd_dma_init(uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _spi_perpih);
static void dma_lcd_wr(const dma_spi_data_t data);
static void dma_lcd_wr_cmd(const cmd payload);
static void dma_lcd_wr_data(const uint16_t payload, const uint32_t amount);
static void dma_buffer_flush_blocking(void);

//Auxillery functions
static void setWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye);
static void fillWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye, color color);
static void delay_ms(uint16_t ms);
static inline void dc_set(void);
static inline void dc_clr(void);
static inline void cs_set(void);
static inline void cs_clr(void);

/**
 * SPI base
 */
static uint32_t spi_perpih;
/**
 * DMA base
 */
static uint32_t dma_periph;
/**
 * DMA channel
 */
static dma_channel_enum dma_channel;

/**
 * GPIO base
 */
static uint32_t gpio_perpih;

/**
 * Reset GPIO pin. Active LOW.
 */
static uint32_t rst;

/**
 * Chip select GPIO pin. Active LOW. 
 */
static uint32_t cs;

/**
 * Data/Command selection GPIO pin. 
 * LOW => Cmd
 * HIGH => Data
 */
static uint32_t dc;

/**
 * Variable holds the current background color set during previous call of lcd_clear()
 */
static color curr_backgr;


int main(void){

	//TODO: ShowNum_float is bugged when writing 10.xxx

	lcd_init(SPI0, DMA0, DMA_CH2, GPIOA, GPIO_PIN_5, GPIO_PIN_7, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3);

	lcd_showStr(30,120,"Hello World!", RED);
	lcd_drawLine(30, 200, 134, 134, RED);
	
	while(1){
		dma_buffer_flush();
	}

	return 0;
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//DMA functions begin 
#define DMA_BUFFER_SIZE 256
/**
 * DMA data buffer
 */
static dma_spi_data_t dma_buffer[DMA_BUFFER_SIZE];
/**
 * LCD data buffer. Fill with pixel value and let DMA transmit to SPI
 */
static uint16_t dma_data;
/**
 * Variables used in DMA buffer logic
 */
static int dma_head = 0, dma_tail = 0;
/**
 * @brief Place in beginning of superloop. Handles DMA queue
 */
void dma_buffer_flush(void){
	/**
	 * Variable is used to DMA ISR to correctly set GPIOx pins based on previous and current data to be transmitted
	 */
	static uint8_t prev_type = 0;

	if( dma_head != dma_tail ){						//Buffer is NOT empty!

		//If same type and SPI tx buffer ready for data!
		if( dma_buffer[dma_tail].type == prev_type && spi_i2s_flag_get(spi_perpih, SPI_FLAG_TBE) == SET ){
			cs_clr();
			dma_channel_disable(dma_periph, dma_channel);	//Start DMA transfer
			dma_data = dma_buffer[dma_tail].payload;
			dma_transfer_number_config(dma_periph, dma_channel, dma_buffer[dma_tail].amount_trans);

			dma_channel_enable(dma_periph, dma_channel);	//Start DMA transfer
			dma_tail = (dma_tail + 1) & (DMA_BUFFER_SIZE - 1);

		//Different types and SPI has finished transmitting
		}else if( dma_buffer[dma_tail].type != prev_type && spi_i2s_flag_get(spi_perpih, SPI_FLAG_TRANS) == RESET ){
			cs_clr();
			dma_channel_disable(dma_periph, dma_channel);	//Start DMA transfer
			dma_data = dma_buffer[dma_tail].payload;
			dma_buffer[dma_tail].type ? dc_set() : dc_clr();	//Data or cmd
			prev_type = dma_buffer[dma_tail].type;
			dma_transfer_number_config(dma_periph, dma_channel, dma_buffer[dma_tail].amount_trans);

			dma_channel_enable(dma_periph, dma_channel); 	//Start DMA transfer
			dma_tail = (dma_tail + 1) & (DMA_BUFFER_SIZE - 1);
		}

	}else{
		if( spi_i2s_flag_get(spi_perpih, SPI_FLAG_TRANS) == RESET ){
		cs_set();
		dma_channel_disable(dma_periph, dma_channel);
		}
	}
}

/**
 * @brief Function used by initialisation of LCD. Blocking
 */
static void dma_buffer_flush_blocking(void){
    static uint8_t prev_type = 0;
    while( dma_head != dma_tail ){						//Buffer is NOT empty!

		//If same type and SPI tx buffer ready for data!
		if( dma_buffer[dma_tail].type == prev_type && spi_i2s_flag_get(spi_perpih, SPI_FLAG_TBE) == SET ){
			cs_clr();
			dma_channel_disable(dma_periph, dma_channel);	//Start DMA transfer
			dma_data = dma_buffer[dma_tail].payload;
			dma_transfer_number_config(dma_periph, dma_channel, dma_buffer[dma_tail].amount_trans);

			dma_channel_enable(dma_periph, dma_channel);	//Start DMA transfer
			dma_tail = (dma_tail + 1) & (DMA_BUFFER_SIZE - 1);
		//Different types and SPI has finished transmitting
		}else if( dma_buffer[dma_tail].type != prev_type && spi_i2s_flag_get(spi_perpih, SPI_FLAG_TRANS) == RESET ){
			cs_clr();
			dma_channel_disable(dma_periph, dma_channel);	//Start DMA transfer
			dma_data = dma_buffer[dma_tail].payload;
			dma_buffer[dma_tail].type ? dc_set() : dc_clr();	//Data or cmd
			prev_type = dma_buffer[dma_tail].type;
			dma_transfer_number_config(dma_periph, dma_channel, dma_buffer[dma_tail].amount_trans);

			dma_channel_enable(dma_periph, dma_channel); 	//Start DMA transfer
			dma_tail = (dma_tail + 1) & (DMA_BUFFER_SIZE - 1);
		}
	}

    while(spi_i2s_flag_get(spi_perpih, SPI_FLAG_TRANS) != RESET);
    cs_set();
}

/**
 * @brief Initialises DMA pherip and channel used by LCD
 * @param[in]: _dma_periph: DMAx(x=0,1)
 * @param[in]: _channel: specify which DMA channel is initialized only one parameter can be selected => 
 * 				DMA0: DMA_CHx(x=0..6), DMA1: DMA_CHx(x=0..4)
 * @param[in]: _spi_periph: SPIx(x=0,1,2).
 */
static void lcd_dma_init(uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _spi_perpih){
	
	rcu_periph_clock_enable(RCU_DMA0);

	dma_periph = _dma_periph;
	dma_channel = _channel;
	dma_channel_disable(dma_periph, dma_channel);
	/**
	 * Initilise dma parameters
	 */
	dma_parameter_struct dma_init_struct;
	dma_struct_para_init(&dma_init_struct);

	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL; 	
	dma_init_struct.memory_addr = (uint32_t)&dma_data; 
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE; 
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT; 			//Buffer 16 bits of data / transfer
	dma_init_struct.number = 0;
	dma_init_struct.periph_addr = (uint32_t)((_spi_perpih) + 0x0CU);
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE; 		
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT; 		//SPIx 16 bit data
	dma_init_struct.priority = DMA_PRIORITY_HIGH;					//Priority
	
	dma_init(dma_periph, dma_channel, &dma_init_struct);
}

static void dma_lcd_wr(const dma_spi_data_t data){
	while(((dma_head + 1) & (DMA_BUFFER_SIZE - 1)) == dma_tail) dma_buffer_flush(); //Flush buff if FULL (OBS BLOCKING!)
	dma_buffer[dma_head] = data;								//Add data to buffer
	dma_head = (dma_head + 1) & (DMA_BUFFER_SIZE - 1);
}

/**
 * @brief Write LCD command
 * @param[in]: payload: Data to be transmitted
 */
static void dma_lcd_wr_cmd(const cmd payload){
	dma_spi_data_t _data = {1, 0, (0x00FF & (payload)) };
	dma_lcd_wr(_data);
}

/**
 * @brief Write LCD data
 * @param[in]: payload: Data to be transmitted
 * @param[in]: amount: How many bytes to send (each DMA tx is 2 bytes)
 */
static void dma_lcd_wr_data(const uint16_t payload, const uint32_t amount){
	dma_spi_data_t _data = {amount , 1, payload};
	dma_lcd_wr(_data);
}

//DMA functions end 
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//SPI functions begin

/**
 * @brief initialises LCD. OBS
 * @param[in]: spi_periph: SPIx(x=0,1,2)
 * @param[in]: _dma_periph: DMAx(x=0,1)
 * @param[in]: _channel: specify which DMA channel is initialized only one parameter can be selected => DMA0: DMA_CHx(x=0..6), DMA1: DMA_CHx(x=0..4)
 * @param[in]: gpio_periph: GPIOx(x = A,B,C,D,E). OBS! Once chosen, base all GPIO pins on input param!
 * @param[in]: clk: SPI clock pin
 * @param[in]: din: SPI data out (MOSI)
 * @param[in]: rst: Reset => GPIO_PIN_x(x=0..15) 
 * @param[in]: cs: Chip select => GPIO_PIN_x(x=0..15)
 * @param[in]: dc: Data or cmd => GPIO_PIN_x(x=0..15)
 */
void lcd_init(uint32_t _spi_perpih, uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _gpio_perpih, uint32_t _clk, uint32_t _din, uint32_t _rst, uint32_t _cs, uint32_t _dc){
	spi_perpih = _spi_perpih;
	gpio_perpih = _gpio_perpih;
	rst = _rst;
	cs = _cs;
	dc = _dc;

	lcd_dma_init(_dma_periph, _channel, spi_perpih);

	/**
	 * Init RCU for SPI and GPIO
	 */
	switch(gpio_perpih){
		case GPIOA: rcu_periph_clock_enable(RCU_GPIOA); break;
		case GPIOB: rcu_periph_clock_enable(RCU_GPIOB); break;
		case GPIOC: rcu_periph_clock_enable(RCU_GPIOC); break;
		case GPIOD: rcu_periph_clock_enable(RCU_GPIOD); break;
		case GPIOE: rcu_periph_clock_enable(RCU_GPIOE); break;
	}
	switch(spi_perpih){
		case SPI0: rcu_periph_clock_enable(RCU_SPI0); break;
		case SPI1: rcu_periph_clock_enable(RCU_SPI1); break;
		case SPI2: rcu_periph_clock_enable(RCU_SPI2); break;
	}

	/**
	 * Init GPIO
	 */
	//clk
	gpio_init(gpio_perpih, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, _clk);
	//din (MOSI)
	gpio_init(gpio_perpih, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, _din);
	//rst
	gpio_init(gpio_perpih, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, rst);
	gpio_bit_set(gpio_perpih, rst);
	//cs
	gpio_init(gpio_perpih, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, cs);
	gpio_bit_set(gpio_perpih, cs);
	//dc
	gpio_init(gpio_perpih, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, dc);

	/**
	 * Init SPI As Master, 8 bit frame size, little endian and f = 27MHz
	 */
	spi_parameter_struct spi_param;

	spi_struct_para_init(&spi_param);
	spi_param.device_mode = SPI_MASTER;
	spi_param.trans_mode = SPI_TRANSMODE_BDTRANSMIT;
	spi_param.frame_size = SPI_FRAMESIZE_16BIT;
	spi_param.nss = SPI_NSS_SOFT;
	spi_param.endian = SPI_ENDIAN_MSB;
	spi_param.clock_polarity_phase= SPI_CK_PL_LOW_PH_1EDGE;
	spi_param.prescale = SPI_PSC_4;	//TODO: Change later to higher!

	//Init spi
	spi_init(spi_perpih, &spi_param);
	//Enable DMA data transfers
	spi_dma_enable(spi_perpih, SPI_DMA_TRANSMIT);

	/**
	 * Enable SPI
	 */
	spi_enable(spi_perpih);

	//HW reset (Reset low for 10-20ms)
	gpio_bit_reset(gpio_perpih, rst);
	delay_ms(40);
	gpio_bit_set(gpio_perpih, rst);
	
	//SW reset (CMD: 0x01, wait 120ms)
	dma_lcd_wr_cmd(SWRESET);
	dma_buffer_flush_blocking();
	delay_ms(130);

	//Sleep out
	dma_lcd_wr_cmd(SLPOUT);
	dma_buffer_flush_blocking();
	delay_ms(130);

