AntonG97/st7789vw-gd32-driver/src/sku22632.c
	//Pixel format (0x3A + data(0x55) RGB16bit)
	dma_lcd_wr_cmd(COLMOD);
	dma_lcd_wr_data(0x5500,1);

	dma_lcd_wr_cmd(INVON);

	dma_lcd_wr_cmd(MADCTL);
	dma_lcd_wr_data(0xA000,1);

	lcd_clear(WHITE);
	dma_buffer_flush_blocking();

	dma_lcd_wr_cmd(DISPON);

	dma_buffer_flush_blocking();
}

//SPI functions ends
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//LCD functions begin

/**
 * @brief Clears LCD screen
 * @param[in]: color: Specifies the color of the screen to be cleared to
 */
void lcd_clear(color color){
	setWindow(0, LCD_X_MAX - 1, 0, LCD_Y_MAX - 1);
	fillWindow(0, LCD_X_MAX - 1, 0, LCD_Y_MAX - 1, color);
	curr_backgr = color;
}

/**
 * @brief Sets a new window
 * @param[in] xs: col start coordinate [0 <= xs <= xe]
 * @param[in] xe: col end coordinate [xs <= xe <= 239]
 * @param[in] ys: row start coordinate [0 <= ys <= ye]
 * @param[in] ye: row end coordinate [ys <= ye <= 319]
 */
static void setWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye){
	//Add offset to get correct window Size
	uint8_t X_OFFSET = 0;
	uint8_t Y_OFFSET = 0;
	if( LCD_X_MAX == 240 && LCD_Y_MAX == 240 ){
		X_OFFSET = 80;
		Y_OFFSET = 0;
	}

	dma_lcd_wr_cmd(CASET);
	dma_lcd_wr_data( xs + X_OFFSET, 1);
	dma_lcd_wr_data( xe + X_OFFSET, 1);

	dma_lcd_wr_cmd(RASET);
	dma_lcd_wr_data( ys + Y_OFFSET, 1);
	dma_lcd_wr_data( ye + Y_OFFSET, 1);
	//RAMWR
	dma_lcd_wr_cmd(RAMWR);
}

/**
 * @brief Sets a new window
 * @param[in] xs: col start coordinate [0 <= xs <= xe]
 * @param[in] xe: col end coordinate [xs <= xe <= 239]
 * @param[in] ys: row start coordinate [0 <= ys <= ye]
 * @param[in] ye: row end coordinate [ys <= ye <= 319]
 * @param[in] color: Color to be filled
 */
static void fillWindow(const uint16_t xs, uint16_t xe, const uint16_t ys, uint16_t ye, color color){
	dma_lcd_wr_cmd(RAMWR);       						// RAMWR (start writing to RAM)
	(xe = (xe > 240 ? LCD_X_MAX : xe));					//Make sure end coordinates is within range
	(ye = (ye > 240 ? LCD_Y_MAX : ye));
	uint16_t dx = xe - xs + 1, dy = ye - ys + 1;

	dma_lcd_wr_data(color, dx*dy);
}

/**
 * @brief Draw single point
 * @param[in] x: col start coordinate [0 <= xs <= 240]
 * @param[in] y: row start coordinate [0 <= ys <= 240]
 * @param[in] color: Color to be filled
 */
void lcd_drawPixel(const uint16_t x, const uint16_t y, color color){
	setWindow(x, x, y, y);
	dma_lcd_wr_data(color, 1);
}

/**
 * @brief Draw single point big size
 * @param[in] x: col start coordinate [0 <= xs <= 240]
 * @param[in] y: row start coordinate [0 <= ys <= 240]
 * @param[in] color: Color to be filled
 */
void lcd_drawPixel_big(const uint16_t x, const uint16_t y, color color){
	lcd_drawCircle_filled(x,y,2,color);
}

/**
 * @brief Sets a new window
 * @param[in] xs: col start coordinate 	[0 <= xs <= xe]
 * @param[in] xe: col end coordinate	[xs <= xe <= 240]
 * @param[in] ys: row start coordinate 	[0 <= ys <= ye]
 * @param[in] ye: row end coordinate 	[ys <= ye <= 240]
 */
void lcd_drawLine(uint16_t xs, uint16_t xe, uint16_t ys, uint16_t ye, color color){
		// Specialfall: vertikal linje
	 if (xs == xe) {						//Vertical line
		 if (ys > ye) { uint16_t tmp = ys; ys = ye; ye = tmp; }
		 setWindow(xs, xs, ys, ye);
		 for (uint16_t y = ys; y <= ye; y++) {
			dma_lcd_wr_data(color,1);
		}
		return;
	}

	// Specialfall: horisontell linje
	if (ys == ye) {							//Horizontal line
		if (xs > xe) { uint16_t tmp = xs; xs = xe; xe = tmp; }
		setWindow(xs, xe, ys, ys);
		for (uint16_t x = xs; x <= xe; x++) {
			dma_lcd_wr_data(color,1);
		}
		return;
	}

	//Bresenham's linjealgoritm. Given by ChatGPT
	int16_t dx = (xe > xs ? xe - xs : xs - xe);	//Abs val
	int16_t dy = -(ye > ys ? ye - ys : ys - ye);//(-)Abs val
	int16_t sx = (xs < xe) ? 1 : -1;			//Direction of x
	int16_t sy = (ys < ye) ? 1 : -1;			//Direction of y
	int16_t err = dx + dy;						//Error term

	while (1) {
		lcd_drawPixel(xs, ys, color);			//Draw pixel
		if (xs == xe && ys == ye) break;		//If both coordinates start = end pos then break
		int16_t e2 = err << 1;					//err * 2
		if (e2 >= dy) {							
			err += dy;
			xs += sx;
		}
		if (e2 <= dx) {
			err += dx;
			ys += sy;
		}
	}
}

/**
 * @brief Draw rectangle
 * @param[in] xs: col start coordinate 	[0 <= xs <= xe]
 * @param[in] xe: col end coordinate	[xs <= xe <= 240]
 * @param[in] ys: row start coordinate 	[0 <= ys <= ye]
 * @param[in] ye: row end coordinate 	[ys <= ye <= 240]
 */
void lcd_drawRec(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye, color color){
	lcd_drawLine(xs, xe, ys, ys, color);		//Upper horiz
	lcd_drawLine(xs, xe, ye, ye, color);		//Lower horiz
	lcd_drawLine(xs, xs, ys, ye, color);		//Lower vert
	lcd_drawLine(xe, xe, ys, ye, color);		//Upper vert
}

/**
 * @brief Draw rectangle
 * @param[in] xs: col start coordinate 	[0 <= xs <= xe]
 * @param[in] xe: col end coordinate	[xs <= xe <= 240]
 * @param[in] ys: row start coordinate 	[0 <= ys <= ye]
 * @param[in] ye: row end coordinate 	[ys <= ye <= 240]
 */
void lcd_drawRec_filled(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye, color color){
	setWindow(xs,xe,ys,ye);
	fillWindow(xs,xe,ys,ye, color);
}

/**
 * @brief Draw circle
 * @param[in]: xs: center x coordinate 
 * @param[in]: ys: center y coordinate 
 * @param[in]: r: radie
 */
void lcd_drawCircle(uint16_t xs, uint16_t ys, uint16_t r, color color){

	//Algoritm to draw circle based on Midpoint circle. Given by ChatGPT
	int16_t x = 0;
    int16_t y = r;
    int16_t d = 1 - r; 
	
	if( xs < r ) xs = r;
	if( ys < r) ys = r;

    while (x <= y) {
        //Draw symmetric points in all eight octants
        lcd_drawPixel(xs + x, ys + y, color);
        lcd_drawPixel(xs - x, ys + y, color);
        lcd_drawPixel(xs + x, ys - y, color);
        lcd_drawPixel(xs - x, ys - y, color);
        lcd_drawPixel(xs + y, ys + x, color);
        lcd_drawPixel(xs - y, ys + x, color);
        lcd_drawPixel(xs + y, ys - x, color);
        lcd_drawPixel(xs - y, ys - x, color);

        if (d < 0) {
            d += 2 * x + 3;
        } else {
            d += 2 * (x - y) + 5;
            y--;
        }
        x++;
    }
}

/**
 * @brief Draw filled circle
 * @param[in]: xs: center x coordinate 
 * @param[in]: ys: center y coordinate 
 * @param[in]: r: radie
 */
void lcd_drawCircle_filled(uint16_t xs, uint16_t ys, uint16_t r, color color){
    int16_t x = 0;
    int16_t y = r;
    int16_t d = 1 - r;

	if( xs < r ) xs = r;
	if( ys < r) ys = r;

