AntonG97/st7789vw-gd32-driver/src/sku22632.c
    while (y >= x) {
		//Draw horizontal lines in all octants

        lcd_drawLine(xs - x, xs + x, ys - y, ys - y, color); //Upper horizontal line
        lcd_drawLine(xs - x, xs + x, ys + y, ys + y, color); //Lower horizontal line
        lcd_drawLine(xs - y, xs + y, ys - x, ys - x, color); //Upper horizontal line (other octants)
        lcd_drawLine(xs - y, xs + y, ys + x, ys + x, color); //Lower horizontal line (other octants)

        x++;

        if (d < 0) {
            d += (x << 1) + 1;
        } else {
            y--;
            d += ((x - y) << 1)+ 1;
        }
    }
}

/**
 * @brief Writes a character on LCD
 * @param[in]: xs: Center x coordinate
 * @param[in]: ys: Center y coordinate
 * @param[in]: ch: Character that is to be written
 * @param[in]: _color: Color of Character
 * @param[in]: size: Size of Character
 */
void lcd_ShowCh(const uint16_t xs, const uint16_t ys, const uint8_t ch, const color _color){
	//Select font
	uint8_t var_y = STD_FONT_Y_SIZE;
	uint8_t *font_type = arial;
	//if( size == NORMAL) {var_y = STD_FONT_Y_SIZE; font_type = arial_normal; }
	//if( size == BIG) {var_y = BIG_FONT_Y_SIZE; font_type = arial_big;}
	int offset = (var_y << 1) * (ch - ' ');

	//Set window size
	uint8_t x = xs - (STD_FONT_X_SIZE >> 1);				//Calc leftmost corner..-
	uint8_t y = ys - (var_y >> 1);							
	setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);//... and set window

	//Write char
	for(uint8_t i = 0; i < (var_y << 1); i++){
		for(int8_t j = 7; j >= 0; j--){
			//Check each bit of each element. If 0b1 => Write new col, else keep current background color
			color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
			dma_lcd_wr_data(set_color,1);
		}
	}
}

/**
 * @brief Writes a string on LCD
 * @param[in]: xs: Center x coordinate
 * @param[in]: ys: Center y coordinate
 * @param[in]: str: String that is to be written
 * @param[in]: _color: Color of Characters
 * @param[in]: size: Size of Characters
 */
void lcd_showStr(const uint16_t xs, const uint16_t ys, const uint8_t *str, const color _color){
	//Select font
	uint8_t var_y = STD_FONT_Y_SIZE;
	uint8_t *font_type = arial;
	//if( size == SMALL){};
	//if( size == NORMAL) {var_y = STD_FONT_Y_SIZE; font_type = arial_normal;}
	//if( size == BIG) {var_y = BIG_FONT_Y_SIZE; font_type = arial_big;}

	uint8_t ind = 0;
	//Loop until NULL
	while( str[ind] != '\0' && ind < STD_FONT_X_SIZE ){		//While char not NULL and ind less than 16 (Max amount of chars on LCD row)
		int offset = (var_y << 1) * (str[ind] - ' ');

		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window

		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				dma_lcd_wr_data(set_color,1);

			}
		}
		ind++;		//Increment index var
	}
}

/**
 * @brief Writes a number on LCD
 * @param[in]: xs: Center x coordinate
 * @param[in]: ys: Center y coordinate
 * @param[in]: val: val to be written
 * @param[in]: _color: Color of val
 * @param[in]: size: Size of val
 */
void lcd_showNum(const uint16_t xs, const uint16_t ys, int val, const color _color){

	if (val == 0) {
    lcd_ShowCh(xs, ys,'0', _color);
    return;
	}

	//Select font
	uint8_t var_y = STD_FONT_Y_SIZE;
	uint8_t *font_type = arial;
	//if( size == SMALL){};
	//if( size == NORMAL) {var_y = STD_FONT_Y_SIZE; font_type = arial_normal;}
	//if( size == BIG) {var_y = BIG_FONT_Y_SIZE; font_type = arial_big;}

	long BASE = 100000000;
	uint8_t ind = 0;
	while( (val / BASE) == 0 && BASE > 1) BASE /= 10;
	
	while( val > 0 && ind < 16 ){
		uint8_t curr_val = val / BASE;		//Get next MSB digit
		val -= (curr_val * BASE);			//Subtract
		BASE /= 10;							//Adjust base

		int offset = (var_y << 1) * (curr_val + '0' - ' ');								//Get correct character
	
		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window
	
		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				dma_lcd_wr_data(set_color,1);
			}
		}
		ind++;		//Increment index var
	}
}

/**
 * @brief Writes a float number on LCD
 * @param[in]: xs: Center x coordinate
 * @param[in]: ys: Center y coordinate
 * @param[in]: val: float val to be written
 * @param[in]: decim_pt: Amount of decimals
 * @param[in]: _color: Color of val
 * @param[in]: size: Size of val
 */
void lcd_showNum_float(const uint16_t xs, const uint16_t ys, const float val, uint8_t decim_pt, const color _color){

	//int decimal_points = 10 * 100000000;
	//Integral
	//.
	//Decimal
	int integral_val = val;										//Get integral part of val
	int decimal_val = (val - integral_val) * 100000000;			//Get decimal part of val
	
    if (val == 0) {
    lcd_ShowCh(xs, ys,'0', _color);
    return;
	}

	//Select font
	uint8_t var_y = STD_FONT_Y_SIZE;
	uint8_t *font_type = arial;
	//if( size == SMALL){};
	//if( size == NORMAL) {var_y = STD_FONT_Y_SIZE; font_type = arial_normal;}
	//if( size == BIG) {var_y = BIG_FONT_Y_SIZE; font_type = arial_big;}

	long BASE = 100000000;
	uint8_t ind = 0;
	while( (integral_val / BASE) == 0 && BASE > 1) BASE /= 10;
	while( integral_val > 0 && ind < 16 ){
		uint8_t curr_val = integral_val / BASE;		//Get next MSB digit
		integral_val -= (curr_val * BASE);			//Subtract
		BASE /= 10;									//Adjust base

		int offset = (var_y << 1) * (curr_val + '0' - ' ');								//Get correct character
	
		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window
	
		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				dma_lcd_wr_data(set_color, 1);
			}
		}
		ind++;		//Increment index var
	}

