AntonG97/st7789vw-gd32-driver/src/sku22632.c
	//Decimal point
	lcd_ShowCh(xs + (STD_FONT_X_SIZE * ind ), ys, '.', _color);
	ind++;


	BASE = 100000000;
	while( (decimal_val / BASE) == 0 && BASE > 1 ) BASE /= 10;
	while( decimal_val > 0 && ind < 16 && decim_pt > 0){

		decim_pt--;

		uint8_t curr_val = decimal_val / BASE;		//Get next MSB digit
		decimal_val -= (curr_val * BASE);			//Subtract
		BASE /= 10;									//Adjust base

		int offset = (var_y << 1) * (curr_val + '0' - ' ');								//Get correct character
	
		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window
	
		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				dma_lcd_wr_data(set_color, 1);
			}
		}
		ind++;		//Increment index var
	}
}

/**
 * @brief Draws picture on LCD.
 * @param[in]: bitMap: Pointer to bitmap of 240x240 / 8 bytes
 */
void lcd_showPicture(uint8_t *bitMap){
    setWindow(0, LCD_X_MAX - 1, 0, LCD_Y_MAX - 1);  

    for (uint16_t y = 0; y < LCD_Y_MAX; y++) {
        for (uint16_t x = 0; x < LCD_X_MAX; x++) {
            uint32_t pixelIndex = y * LCD_X_MAX + x;	//Pixel index
            uint32_t byteIndex = pixelIndex / 8;		//Byte index
            uint8_t bitIndex = 7 - (pixelIndex % 8);  	//MSB first

            uint8_t byte = bitMap[byteIndex];		
            uint8_t bit = (byte >> bitIndex) & 0x01;	

            color set_color = (bit == 1) ? BLACK : WHITE;

			dma_lcd_wr_data(set_color, 1);
        }
    }
}

//LCD functions ends
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Auxillary functions
/**
 * @brief Delays (blocking)
 * @param[in] ms: Amount of ms to delay
 */
static void delay_ms(uint16_t ms){
	volatile long long base = 7200; 	//Base
	base = base*(long long)ms;			//Mult base with ms
	while(--base) __asm__ volatile("nop");
}
static inline void dc_set(void) {
    gpio_bit_set(gpio_perpih, dc);
}

static inline void dc_clr(void) {
    gpio_bit_reset(gpio_perpih, dc);
}

static inline void cs_set(void) {
    gpio_bit_set(gpio_perpih, cs);
}

static inline void cs_clr(void) {
    gpio_bit_reset(gpio_perpih, cs);
}